# Conductor Size Create Method

Source: https://www.revitapidocs.com/2026/563d9315-533d-5266-e556-14dbf0163b29.htm

---

| Conductor Size Create Method |
| --- |

Creates a Conductor Size.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ConductorSize Create(
	Document document
)
```

```
Public Shared Function Create (
	document As Document
) As ConductorSize
```

```
public:
static ConductorSize^ Create(
	Document^ document
)
```

```
static member Create :
        document : Document -> ConductorSize
```

#### Parameters

document Document
:   The document.

#### Return Value

ConductorSize
The newly created Conductor Size data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements).  \-or\-  The document is being loaded, or is in the midst of another  sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace